# language: ru
Функционал: Тестирование компонентов lib.ui

  Предыстория:
    * пользователь фокусируется на браузере

  Сценарий: Доступность
    * пользователь проверяет доступность примеров библиотеки по пути "WebAddress"
    * пользователь проверяет доступность примеров библиотеки по пути "WebAgreement"
    * пользователь проверяет доступность примеров библиотеки по пути "WebComingNext"
    * пользователь проверяет доступность примеров библиотеки по пути "WebFullName"
    * пользователь проверяет доступность примеров библиотеки по пути "WebPersonalDataSummary"
    * пользователь проверяет доступность примеров библиотеки по пути "WebProcessAlert"
    * пользователь проверяет доступность примеров библиотеки по пути "WebProductDescription"
    * пользователь проверяет доступность примеров библиотеки по пути "WebRange"
    * пользователь проверяет доступность примеров библиотеки по пути "WebResource"
    * пользователь проверяет доступность примеров библиотеки по пути "WebSearchSelect"
    * пользователь проверяет доступность примеров библиотеки по пути "WebStatusHeadline"
    * пользователь проверяет доступность примеров библиотеки по пути "WebSummary"
    * пользователь проверяет доступность примеров библиотеки по пути "WebTotal"
    * пользователь проверяет доступность примеров библиотеки по пути "WebUpcomingStep"
    * пользователь проверяет доступность примеров библиотеки по пути "WebHeadline"
