# language: ru
Функционал: Тестирование виджетов

  Предыстория:
    * пользователь фокусируется на браузере

  Сценарий: Доступность
    * пользователь проверяет доступность примеров библиотеки по пути "CoreFieldset"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreFieldset"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreAccount"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreConfirmation"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreMoney"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreMoneyFixedCurrency"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreResource"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreStatus"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreTotal"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreRuPhone"
    * пользователь проверяет доступность примеров библиотеки по пути "CoreStatusHeadline"
