import { distance } from '..'

describe('Тестирование функции, вычисляющей расстояние Левенштейна', () => {
    it('\'ипо\', \'ипотечный кредит\'', () => {
        expect(distance('ипо', 'ипотечный кредит')).toBe(13)
    })

    it('\'ипотека\', \'ипотечный кредит\'', () => {
        expect(distance('ипотека', 'ипотечный кредит')).toBe(10)
    })

    it('\'ипотечный кре\', \'ипотечный кредит\'', () => {
        expect(distance('ипотечный кре', 'ипотечный кредит')).toBe(3)
    })

    it('\'ипо\', \'ипотека\'', () => {
        expect(distance('ипо', 'ипотека')).toBe(4)
    })

    it('\'ипотека\', \'ипотека\'', () => {
        expect(distance('ипотека', 'ипотека')).toBe(0)
    })

    it('\'ипотека\', \'ипотеку\'', () => {
        expect(distance('ипотека', 'ипотеку')).toBe(1)
    })

    it('\'ипотечный кре\', \'ипотека\'', () => {
        expect(distance('ипотечный кре', 'ипотека')).toBe(8)
    })

    it('\'н\', \'ипотека\'', () => {
        expect(distance('н', 'ипотека')).toBe(7)
    })

    it('\'нg\', \'ипотека\'', () => {
        expect(distance('нg', 'ипотека')).toBe(7)
    })

    it('\'нул\', \'ипотека\'', () => {
        expect(distance('нул', 'ипотека')).toBe(7)
    })

    it('\'чат со сбербанком\', \'чат со сбербанком\'', () => {
        expect(distance('чат со сбербанком', 'чат со сбербанком')).toBe(0)
    })

    it('\'переводы\', \'перевод между своими счетами и картами\'', () => {
        expect(distance('переводы', 'перевод между своими счетами и картами')).toBe(31)
    })

    it('\'пиревоты\', \'перевод\'', () => {
        expect(distance('пиревоты', 'перевод')).toBe(3)
    })
})
